000001000000       PROCESS  OPTIONS.
000002000000       IDENTIFICATION DIVISION.
000003000000       PROGRAM-ID. VERIFY.
000004000000         AUTHOR. PROGRAMMER NAME.
000005000000         INSTALLATION. TORONTO LABORATORY.
000006220328         DATE-WRITTEN. JANUARY 1, 2022.s
000007000000         DATE-COMPILED.
000008000000       ENVIRONMENT DIVISION.
000009000000       CONFIGURATION SECTION.
000010000000         SOURCE-COMPUTER. IBM-I.
000011000000         OBJECT-COMPUTER. IBM-I.
000012000000       INPUT-OUTPUT SECTION.
000013000000       FILE-CONTROL.
000014000000           SELECT FILE1 ASSIGN TO PRINTER-QSYSPRT
000015000000                  ORGANIZATION IS SEQUENTIAL.
000016000000       DATA DIVISION.
000017000000       FILE SECTION.
000018000000       FD  FILE1
000019000000           RECORD CONTAINS 39 CHARACTERS.
000020000000       01  REC-1 PIC X(39).
000021000000       WORKING-STORAGE SECTION.
000022000000       01  PRINT-LINE  PIC X(39) VALUE
000023000000           "ILE COBOL INSTALLATION IS VERIFIED.".
000024000000       77 ERROR-COUNT PIC 9(3) VALUE ZEROES.
000025000000       01 TEST-VARS.
000026000000          05 A PIC 99 USAGE BINARY.
000027000000          05 B PIC 99 USAGE COMP-3.
000028000000          05 C PIC 999999 USAGE PACKED-DECIMAL.
000029000000          05 D PIC S99 USAGE BINARY.
000030000000       PROCEDURE DIVISION.
000031000000       TEST1-INIT.
000032000000           MOVE 5 TO A.
000033000000           MOVE 2 TO B.
000034000000           MOVE -5 TO D.
000035000000       TEST-COMPUTE.
000036000000           COMPUTE C = A * B + D.
000037000000           IF A NOT = 5 OR B NOT = 2 OR D NOT = -5 OR C NOT = 5
000038000000            DISPLAY "COMPUTE FAILED FOR THE FOLLOWING:"
000039000000            DISPLAY "A = 5 =" A
000040000000            DISPLAY "B = 2 =" B
000041000000            DISPLAY "D = -5 =" D
000042000000            DISPLAY "Compute: 5 =" C
000043000000            ADD 1 TO ERROR-COUNT.
000044000000       TEST-ADD.
000045000000           ADD A B A B GIVING C.
000046000000           IF C NOT = 14
000047000000            DISPLAY "ADD FAILED FOR THE FOLLOWING:"
000048000000            DISPLAY "Add: 14 =" C
000049000000            ADD 1 TO ERROR-COUNT.
000050000000       TEST-SUBTRACT.
000051000000           SUBTRACT B D FROM A GIVING C.
000052000000           IF C NOT = 8
000053000000            DISPLAY "SUBTRACT FAILED FOR THE FOLLOWING:"
000054000000            DISPLAY "Subtract: 8 =" C
000055000000            ADD 1 TO ERROR-COUNT.
000056000000       TEST-DIVIDE.
000057000000           DIVIDE A BY B GIVING C.
000058000000           IF C NOT = 2 THEN
000059000000            DISPLAY "DIVIDE FAILED FOR THE FOLLOWING:"
000060000000            DISPLAY "Divide: 2 =" C
000061000000            ADD 1 TO ERROR-COUNT.
000062000000       FINISHED-NOW.
000063000000           IF ERROR-COUNT = 0 THEN
000064000000            OPEN OUTPUT FILE1
000065000000            WRITE REC-1 FROM PRINT-LINE
000066000000            CLOSE FILE1.
000067000000           STOP RUN.
